interface Coordinates {
  name: string,
  coord: [number, number],
}

interface Point {
  county: string,
  coordinates: Coordinates[]
}

export const points: Point[] = [
  {
    county: '更合',
    coordinates: [
      {
        name: '官山',
        coord: [22.698411,112.426577],
      },
      {
        name: '高村',
        coord: [22.7254,112.44357]
      },
      {
        name: '白洞',
        coord: [22.745972,112.421213]
      },
      {
        name: '香山',
        coord: [22.7497,112.45913]
      },
      {
        name: '吉田',
        coord: [22.74544,112.45234]
      },
      {
        name: '水井',
        coord: [22.735155,112.469099]
      },
      {
        name: '巨泉',
        coord: [22.770854,112.485344]
      },
      {
        name: '界村',
        coord: [22.773248,112.495708]
      },
      {
        name: '良村',
        coord: [22.79633,112.50224]
      },
      {
        name: '布练',
        coord: [22.80063,112.51079]
      },
      {
        name: '合水',
        coord: [22.80353,112.50769]
      },
      {
        name: '小洞',
        coord: [22.76532,112.54395]
      },
      {
        name: '泽河',
        coord: [22.72289,112.55673]
      },
      {
        name: '版村',
        coord: [22.655757,112.550835]
      },
      {
        name: '宅布',
        coord: [22.7993,112.52912]
      },
      {
        name: '白石',
        coord: [22.80462,112.57033]
      },
      {
        name: '更楼',
        coord: [22.781575,112.582562]
      },
      {
        name: '平塘',
        coord: [22.857837,112.699019]
      },
      {
        name: '珠塘',
        coord: [22.77145,112.58444]
      },
      {
        name: '大幕',
        coord: [22.782796,112.621635]
      },
      {
        name: '歌乐',
        coord: [22.83275,112.61084]
      },
      {
        name: '新圩',
        coord: [22.871452,112.614969]
      }
    ],
  },
  {
    county: '明城',
    coordinates:[
      {
        name: '苗迳',
        coord: [22.93926,112.6854]
      },
      {
        name: '新岗',
        coord: [22.926159,112.76167]
      },
      {
        name: '潭朗',
        coord: [22.904488,112.728351]
      },
      {
        name: '崇步',
        coord: [22.9029,112.74]
      },
      {
        name: '石塘',
        coord: [22.88602,112.70001]
      },
      {
        name: '罗稳',
        coord: [22.873032,112.648857]
      },
      {
        name: '明北',
        coord: [22.85895,112.70158]
      },
      {
        name: '明东',
        coord: [22.86808,112.716931]
      },
      {
        name: '明城',
        coord: [22.857161,112.707124]
      },
      {
        name: '明西',
        coord: [22.848266,112.673186]
      },
      {
        name: '明阳',
        coord: [22.848998,112.698173]
      },
      {
        name: '明南',
        coord: [22.82988,112.69043]
      },
      {
        name: '坟典',
        coord: [22.80384,112.64423]
      },
      {
        name: '光明',
        coord: [22.79067,112.66042]
      },
    ]
  },
  {
    county: '杨和',
    coordinates: [
      {
        name: '豸岗',
        coord: [22.87645,112.78607]
      },
      {
        name: '圆岗',
        coord: [22.87314,112.78316]
      },
      {
        name: '岗水',
        coord: [22.86746,112.76706]
      },
      {
        name: '人和',
        coord: [22.86665,112.790456]
      },
      {
        name: '清泰',
        coord: [22.860784,112.790005]
      },
      {
        name: '对川',
        coord: [22.85196,112.750537]
      },
      {
        name: '河东',
        coord: [22.818623,112.797343]
      },
      {
        name: '河西',
        coord: [23.081464,113.160081]
      },
      {
        name: '沙水',
        coord: [22.79438,112.74283]
      },
      {
        name: '石水',
        coord: [22.78152,112.79179]
      },
    ]
  },
  {
    county: '荷城',
    coordinates: [
      {
        name: '江湾',
        coord: [22.995493,112.827458]
      },
      {
        name: '石洲',
        coord: [22.97463,112.7568]
      },
      {
        name: '照明',
        coord: [22.960913,112.833192]
      },
      {
        name: '范洲',
        coord: [22.95934,112.79891]
      },
      {
        name: '南洲',
        coord: [22.92876,112.78569]
      },
      {
        name: '王臣',
        coord: [22.953103,112.815347]
      },
      {
        name: '泰兴',
        coord: [22.93068,112.83166]
      },
      {
        name: '阮埇',
        coord: [22.937856,112.855911]
      },
      {
        name: '庆洲',
        coord: [22.93267,112.80752]
      },
      {
        name: '苏村',
        coord: [22.932158,112.868102]
      },
      {
        name: '塘南',
        coord: [22.93029,112.801072]
      },
      {
        name: '泰华',
        coord: [22.8921,112.861944]
      },
      {
        name: '罗西',
        coord: [22.908145,112.860493]
      },
      {
        name: '明湖',
        coord: [22.927916,112.863974]
      },
      {
        name: '长安',
        coord: [22.901915,112.876642]
      },
      {
        name: '泰和',
        coord: [22.90927,112.84556]
      },
      {
        name: '尼教',
        coord: [22.89742,112.82568]
      },
      {
        name: '仙村',
        coord: [22.87697,112.80817]
      },
      {
        name: '铁岗',
        coord: [22.884116,112.834676]
      },
      {
        name: '河江',
        coord: [22.90255,112.85312]
      },
      {
        name: '中山',
        coord: [22.896437,112.870957]
      },
      {
        name: '竹园',
        coord: [22.899147,112.886742]
      },
      {
        name: '安泰',
        coord: [22.892859,112.879283]
      },
      {
        name: '三洲',
        coord: [22.883448,112.853388]
      },
      {
        name: '岭南',
        coord: [22.89547,112.882857]
      },
      {
        name: '健力',
        coord: [22.901243,112.890319]
      },
      {
        name: '育才',
        coord: [22.892492,112.896894]
      },
      {
        name: '金华',
        coord: [22.89103,112.881826]
      },
      {
        name: '月明',
        coord: [22.886499,112.880582]
      },
      {
        name: '伦埇',
        coord: [22.882165,112.85319]
      },
      {
        name: '孔堂',
        coord: [22.873969,112.8147]
      },
    ]
  },
  
  // {
  //   name: '',
  //   coord: []
  // }
]